[
  {
    "surah": "Al-Mutaffifin",
    "verse": "83:29-33",
    "text": "The disbelievers mock the believers, laughing at them and exchanging sarcastic glances, calling them 'astray.'",
    "stage": "Denial & Antilocution",
    "commentary": "This verse illustrates verbal hostility and mockery, key characteristics of Allport's first stage of prejudice, where groups express disdain through words.",
    "tafsir": "Tafsir Ibn Kathir explains this as the behavior of disbelievers mocking believers for their faith, a common tactic to undermine their resolve.",
    "historicalContext": "Revealed in Makkah, this reflects the early persecution of Muslims by the Quraysh, who ridiculed believers to maintain social dominance.",
    "hadeeth": "The Prophet (peace be upon him) said, 'Be patient, for no time will come upon you but the one after it will be worse, till you meet your Lord.' (Sahih al-Bukhari)",
    "comparativeReligion": "Similar to early Christian communities facing Roman mockery, this reflects a universal pattern of verbal hostility toward emerging faiths.",
    "islamophobia": "Modern parallels include derogatory language used to stereotype Muslims, often seen in media portrayals.",
    "significance": "This teaches believers to remain steadfast despite ridicule, emphasizing resilience in faith."
  },
  {
    "surah": "Al-Baqarah",
    "verse": "2:49",
    "text": "Recounts Pharaoh's systematic slaughter of the sons of the Israelites, a clear act of attempted genocide against an ethnic-religious group.",
    "stage": "Extermination",
    "commentary": "This verse represents the extreme of Allport's scale, where prejudice escalates to attempts at annihilating a group.",
    "tafsir": "Tafsir Jalalayn notes Pharaoh's fear of the Israelites' growing numbers led to this brutal policy to maintain control.",
    "historicalContext": "Refers to the oppression of Bani Israel in Egypt, where Pharaoh ordered the killing of male newborns to suppress their population.",
    "hadeeth": "The Prophet (peace be upon him) said, 'The best of people are those who face the greatest trials.' (Sunan al-Tirmidhi)",
    "comparativeReligion": "Comparable to genocidal acts in history, such as the Holocaust, targeting specific religious or ethnic groups.",
    "islamophobia": "Reflects extreme Islamophobic actions where entire communities are targeted for their beliefs, as seen in historical and modern genocides.",
    "significance": "Highlights the importance of resisting oppression and the divine promise of deliverance for the oppressed."
  }
  // Add more entries as needed
]
